// Зробити свій розпоряжок дня.
//
//     Мають бути функції, які є асинхронними (мають сетТаймАут або сетІнтервал) які описують якусь певну вашу дію в день.
//     Наприклад функція прокинутись триває 1с, поїсти - 0,5с. Доїхати до роботи - 2с. Пообідати - 1с.
//     Зробити таких функцій в районі 10 штук. Функція має приймати параметр, який буде відповідати за успішне чи не успішне виконання.
//     Далі виконати їх в тій послідовності, в якій ви виконуєте їх у свій звичайний день.
//

//     Тобто, як приклад
// Прокинулись - Поснідали - Зібрались - ПОїхали на роботу - Працююєте - Пообідали - Працюєте -
// Випили кави - Працюєте - Поїхали до дому - Повчились - Лягли спати.
//
//     Кожна функція має мати якесь успіше або не успішне виконання.
//     Тобто можливий варіант, що при виконанні функції доїхати на роботу ви стали в заторі і не попали на роботу.
//     Або йдучи на обід ви забули гаманець і лишились голодні.
// let timeToGetUp = 6.3
// Прокинулись -
let timeToWash = 0.25;
let timeToBreakfast = 0;
let timeToGoing = 0;
let timeToCoffe = 0

function getUp(time, cb) {
    setTimeout(() => {
        if (time !== 6.30) {
            console.log('Я запізнююсь');
            cb('Я проспав')
        } else {
            console.log('Доброго ранку' + ', ' + 'зараз' + ' ' + time +'.' + 'Пора йти вмиватись');
            timeToBreakfast = time + timeToWash

            cb(null, timeToBreakfast)
        }
    }, 2000)
}

// Поснідали -
function breakfast(time, cb) {
    setTimeout(() => {
        if (time === 6.55) {
            console.log('Снідаю');
            timeToGoing = 7.4;
            cb(null, timeToGoing)
        } else {
            console.log('ну його той снданок, я спізнююсь на роботу');
            cb('Я проспав')
        }
    }, 2000)
}
// Зібрались -
// ПОїхали на роботу -
// Працююєте -
function work (time, cb) {
    setTimeout(() => {
        if (time === 7.4) {
            console.log('Працюю в ппоті чола');
            timeToCoffe = 11.00
            cb(null, timeToCoffe)
        } else {
            console.log('Я запізнююсь')
            cb('Я проспав')
        }
    }, 2000)
}
// Пообідали -
// Працюєте -
// Випили кави -
// Працюєте -
// Поїхали до дому -
// Повчились -
// Лягли спати.

getUp(6.3, (err, time) => {
    if (err) {
        console.log('Я проспав');
    } else {
        console.log(time + ', ' + 'пора йти снідати');

        breakfast(time, (err, time) => {
            if (err) {
                console.log('err');
            } else {
                console.log('Зараз' + ' ' + time + ', ' + 'пора їхати на роботу');

                work(time, (err, time) => {
                    if (err) {
                        console.log('Я проспав');
                    } else {
                        console.log(time + ' ' + 'година, ' + 'пора випити кави');
                    }
                })
            }
        })
    }
})

